###############################################################################
# Created by write_sdc
# Fri May  7 17:11:42 2021
###############################################################################
current_design jpeg_encoder
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 1805.8198 -waveform {0.0000 902.9099} [get_ports {clk}]
###############################################################################
# Environment
###############################################################################
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
