###############################################################################
# Created by write_sdc
# Fri May  7 16:14:44 2021
###############################################################################
current_design gcd
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 277.8394 -waveform {0.0000 138.9197} [get_ports {clk}]
###############################################################################
# Environment
###############################################################################
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
