###############################################################################
# Created by write_sdc
# Fri May  7 17:39:39 2021
###############################################################################
current_design ibex_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 1965.0071 -waveform {0.0000 982.5035} [get_ports {clk_i}]
###############################################################################
# Environment
###############################################################################
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
