###############################################################################
# Created by write_sdc
# Fri May  7 14:28:49 2021
###############################################################################
current_design aes_cipher_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 600 -waveform {0.00 300.00} [get_ports {clk}]
###############################################################################
# Environment
###############################################################################
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
