write_def "output/$sc_design.def"
write_sdc "output/$sc_design.sdc"
write_verilog "output/$sc_design.v"
write_db "output/$sc_design.odb"

