write_db "outputs/${sc_topmodule}.odb"
write_def "outputs/${sc_topmodule}.def"
write_verilog -include_pwr_gnd "outputs/${sc_topmodule}.vg"
