
 
proc
    
techmap -map +/adff2dff.v
techmap -map /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/yosys_models.v */t:$mul */t:$mem */t:$sub */t:$add
techmap
read_verilog -lib /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/adder.v
read_verilog -lib /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/multiply.v
read_verilog -lib /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/single_port_ram.v     #(SSS) will be replaced by single_port_ram.v by python script
read_verilog -lib /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/dual_port_ram.v     #(DDD) will be replaced by dual_port_ram.v by python script

# Rename singlePortRam to single_port_ram
# Rename dualPortRam to dualZ_port_ram
# rename function of Yosys not work here
# since it may outcome hierarchy error
read_verilog /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/pram_rename.v         #(SSR) will be replaced by spram_rename.v by python script
read_verilog /home/kimia/siliconcompiler/siliconcompiler/tools/yosys/vpr_yosyslib/dpram_rename.v         #(DDR) will be replaced by dpram_rename.v by python script
    #Flatten the design
flatten

    # Check
stat
synth -run check

    # Clean and output blifver      
opt_clean -purge